<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0">
  <policyNamespaces>
    <target prefix="Lithnet" namespace="Lithnet" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <supersededAdm fileName="" />
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="CAT_300017F2_090D_4E59_A535_01350C2E0428" displayName="$(string.CAT_300017F2_090D_4E59_A535_01350C2E0428)" />
  </categories>
</policyDefinitions>