<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0"
schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="TS_SUPPORTED_OS">At least Microsoft Windows 8.1 or Windows Server 2012</string>
      <string id="cat_lithnet_accessManagerAgent_password_ad">Administrator password management</string>

      <string id="pol_password_generation_ad">Manage passwords and store them in AD</string>
      <string id="pol_password_generation_ad_help">When this policy is enabled, the agent will generate and rotate the password for the local administrator account using the settings defined in the policy.

Lithnet Access Manager Agent always stores passwords in an encrypted format in the directory, but you can choose how you want the agent to manage the Microsoft LAPS attribute  (ms-Mcs-AdmPwd), if present in your directory. You can select one of the following values;

- None. The agent will not manage the Microsoft LAPS attribute. If this attribute is populated with data, it will remain in place.
- Populate. The agent will store the plain-text password in the Microsoft LAPS attribute. This allows for compatibility with the Microsoft LAPS client, and allows for a transitional roll out strategy while you migrate to Lithnet Access Manager
- Clear. Use this option when you have fully migrated to Lithnet Access Manager, and want to clear any old passwords in the Microsoft LAPS attribute

Note that if the Microsoft LAPS agent is installed and enabled, the Lithnet Access Manager Agent will be automatically disabled.

The agent can also keep previous passwords as it changes them, up to the maximum age specified here. This can allow access to the previous local admin passwords in the event that a machine is restored from a backup or snapshot. If this value is set to zero, no previous passwords are retained.

If this policy is disabled or not configured, the administrator password will not be changed.

If the policy enabling AMS-based storage is enabled, then this policy setting is ignored.
      </string>

      <string id="pol_password_generation_ams">Manage passwords and store them in AMS</string>
      <string id="pol_password_generation_ams_help">When this policy is enabled, the agent will generate and rotate the password for the local administrator account, encrypt it, and store it on the Access Manager server. 

Password complexity settings come from the AMS server itself, and are not configured via group policy.

If this policy is enabled it will override the AD-based storage policies, if they are enabled.

If this policy is disabled or not configured, the administrator password will not be rotated and stored in the Access Manager server.
      </string>

      <string id="enum_MsMcsAdmPwdBehaviour_ignore">None</string>
      <string id="enum_MsMcsAdmPwdBehaviour_populate">Populate</string>
      <string id="enum_MsMcsAdmPwdBehaviour_clear">Clear existing values</string>

    </stringTable>

    <presentationTable>
      <presentation id="pol_password_generation_ad">
        <decimalTextBox refId="dtxt_passwordAge" defaultValue="7">Maximum password age (days)</decimalTextBox>
        <decimalTextBox refId="dtxt_passwordLength" defaultValue="16">Password length</decimalTextBox>
        <text></text>
        <text>Select the types of characters to use when generating a password</text>
        <checkBox refId="ck_useLower" defaultChecked="true" >Use lower-case letters</checkBox>
        <checkBox refId="ck_useUpper" defaultChecked="true">Use upper-case letters</checkBox>
        <checkBox refId="ck_useNumeric" defaultChecked="true" >Use numbers</checkBox>
        <checkBox refId="ck_useSymbol" defaultChecked="false" >Use symbols</checkBox>
        <text></text>
        <dropdownList refId="enum_MsMcsAdmPwdBehaviour" defaultItem="0" noSort="true">Microsoft LAPS attribute compatibility</dropdownList>
        <text></text>
        <text>Password history</text>
        <decimalTextBox refId="dtxt_passwordHistoryDaysToKeep" defaultValue="30">Number of days to keep retired passwords for</decimalTextBox>
      </presentation>

      <presentation id="pol_password_generation_ams">
       
      </presentation>

    </presentationTable>
  </resources>
</policyDefinitionResources>