<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0"
schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="TS_SUPPORTED_OS">At least Microsoft Windows 8.1 or Windows Server 2012</string>
      <string id="cat_lithnet_accessManagerAgent_password">Administrator password</string>

      <string id="pol_password_generation">Manage the local administrator password</string>
      <string id="pol_password_generation_help">When this policy is enabled, the agent will generate and rotate the password for the local administrator account using the settings defined in the policy.

You must choose how you want to store the password in the directory. 

- You can use the native Lithnet Access Manager format, which encrypts the passwords and stores it in a special object in the directory. These passwords can only be accessed through the Lithnet Access Manager web app which has been configured with the appropriate decryption key. Choosing this format also allows you to enable the storage of previous passwords, to allow recovery in the event a machine is restored from backup.

- You can store the password in the Microsoft LAPS 'ms-Mcs-AdmPwd' attribute on the computer object, to allow compatibility with the Microsoft LAPS client. You must have the Microsoft LAPS schema deployed and appropriate ACLs in place to protect the plain-text password.
      
- Or you can store the password in both locations, which will allow compatibility with Microsoft LAPS clients, as well as enabling Access Manager features such as password history.
      
If this policy is disabled or not configured, the administrator password will not be changed.</string>

      <string id="pol_history">Enable password history</string>
      <string id="pol_history_help">When this policy is enabled, the agent will keep previous passwords as it changes them, up to the maximum age specified here.
      
This can allow access to the previous local admin passwords in the event that a machine is restored from a backup or snapshot.

If this policy is disabled or not configured, no password history is retained.</string>

      <string id="enum_appdata">Encrypted Lithnet Access Manager attributes</string>
      <string id="enum_laps">Microsoft LAPS attributes</string>
      <string id="enum_appdata_laps">Both</string>
      <string id="pol_certresolver">Specify encryption certificate location</string>
      <string id="pol_certresolver_help">When this policy is enabled, you can specify a local path, UNC path, or HTTPS URL where the agent should obtain the certificate used for encrypting the passwords from. This setting only applies when using the Lithnet Access Manager attributes to store passwords.
      
If using a remote path, this location should be highly available. If using a UNC path, this could be on the domain's SYSVOL share, where it is automatically replicated to all domain controllers.

The certificate must be a CER file, either base-64 or DER encoded. It cannot be a PFX file. 

If you disable or do not configure this setting, the agent will attempt to find a certificate published by the Lithnet Access Manager Service in the directory</string>
    </stringTable>

    <presentationTable>
      <presentation id="pol_password_generation">
        <dropdownList refId="enum_storageMode" defaultItem="1" noSort="true">Password storage location</dropdownList>
        <text></text>
        <decimalTextBox refId="dtxt_passwordAge" defaultValue="7">Maximum password age (days)</decimalTextBox>
        <decimalTextBox refId="dtxt_passwordLength" defaultValue="16">Password length</decimalTextBox>
        <text></text>
        <text>Select the types of characters to use when generating a password</text>
        <checkBox refId="ck_useLower" defaultChecked="true" >Use lower-case letters</checkBox>
        <checkBox refId="ck_useUpper" defaultChecked="true">Use upper-case letters</checkBox>
        <checkBox refId="ck_useNumeric" defaultChecked="true" >Use numbers</checkBox>
        <checkBox refId="ck_useSymbol" defaultChecked="false" >Use symbols</checkBox>
      </presentation>
      <presentation id="pol_history">
        <decimalTextBox refId="dtxt_passwordHistoryDaysToKeep" defaultValue="30">Maximum number of days to keep retired passwords for</decimalTextBox>
      </presentation>
      <presentation id ="pol_certresolver">
        <text>Specify a local path, a UNC path, or HTTPS URL where the .CER file used for encryption should reside.</text>
        <textBox refId="txt_certpath">
          <label>Certificate path</label>
        </textBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>