<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0"
schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="TS_SUPPORTED_OS">At least Microsoft Windows 8.1 or Windows Server 2012</string>
      <string id="cat_lithnet_accessManagerAgent_password">Administrator password</string>

      <string id="pol_password_generation">Manage the local administrator password</string>
      <string id="pol_password_generation_help">When this policy is enabled, the agent will generate and rotate the password for the local administrator account using the settings defined in the policy.</string>

      <string id="pol_storage_options">Specify Active Directory storage options</string>
      <string id="pol_storage_options_help">When this policy is enabled, you can choose options for storing the local admin password.

When the advanced agent mode is enabled, the agent will always send password details to the AMS server. Optionally, you can also choose to store the password in either the Microsoft LAPS active directory attribute (ms-Mcs-AdmPwd), and the Lithnet LAPS active directory attribute (lithnetLocalAdminPassword).

When the advanced agent mode is disabled, the agent always stores passwords in an encrypted format in active directory, in the lithnetLocalAdminPassword attribute. You can choose how you want the agent to manage the Microsoft LAPS attribute  (ms-Mcs-AdmPwd), if present in your directory. You can select one of the following values;

- None. The agent will not manage the Microsoft LAPS attribute. If this attribute is populated with data, it will remain in place.
- Populate. The agent will store the plain-text password in the Microsoft LAPS attribute. This allows for compatibility with the Microsoft LAPS client, and allows for a transitional roll out strategy while you migrate to Lithnet Access Manager
- Clear. Use this option when you have fully migrated to Lithnet Access Manager, and want to clear any old passwords in the Microsoft LAPS attribute

Note that if the Microsoft LAPS agent is installed and enabled, the Lithnet Access Manager Agent will be automatically disabled.

You can also choose to store previous passwords. The agent will keep previous passwords as it changes them, up to the maximum age specified here. This can allow access to the previous local admin passwords in the event that a machine is restored from a backup or snapshot.

If this policy is disabled or not configured, and advanced agent mode is disabled, passwords will be stored only in the lithnetAdminPassword directory attribute.
If this policy is disabled or not configured, and advanced agent mode is enabled, passwords will be stored only in the AMS server itself.
      </string>
      <string id="enum_MsMcsAdmPwdBehaviour_ignore">None</string>
      <string id="enum_MsMcsAdmPwdBehaviour_populate">Populate</string>
      <string id="enum_MsMcsAdmPwdBehaviour_clear">Clear existing values</string>
    </stringTable>

    <presentationTable>
      <presentation id="pol_password_generation">
        <decimalTextBox refId="dtxt_passwordAge" defaultValue="7">Maximum password age (days)</decimalTextBox>
        <decimalTextBox refId="dtxt_passwordLength" defaultValue="16">Password length</decimalTextBox>
        <text></text>
        <text>Select the types of characters to use when generating a password</text>
        <checkBox refId="ck_useLower" defaultChecked="true" >Use lower-case letters</checkBox>
        <checkBox refId="ck_useUpper" defaultChecked="true">Use upper-case letters</checkBox>
        <checkBox refId="ck_useNumeric" defaultChecked="true" >Use numbers</checkBox>
        <checkBox refId="ck_useSymbol" defaultChecked="false" >Use symbols</checkBox>
        <text></text>
      </presentation>
      <presentation id="pol_storage_options">
        <dropdownList refId="enum_MsMcsAdmPwdBehaviour" defaultItem="0" noSort="true">Microsoft LAPS attribute compatibility (ms-Mcs-AdmPwd attribute)</dropdownList>
        <dropdownList refId="enum_LithnetLocalAdminPasswordBehaviour" defaultItem="0" noSort="true">Lithnet LAPS attribute compatibility (advanced agent only)</dropdownList>
        <checkBox refId="ck_paswordHistoryEnable" defaultChecked="false" >Store retired passwords in Active Directory (lithetAdminPasswordHistory attribute)</checkBox>
        <decimalTextBox refId="dtxt_passwordHistoryDaysToKeep" defaultValue="30">Number of days to keep retired passwords for</decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>