<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0"
                           schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="cat_lithnet_accessManagerAgent">Access Manager Agent</string>
      <string id="pol_enableAgent">Enable the Lithnet Access Manager Agent</string>
      <string id="pol_enableAgent_help">When enabled, the agent will run at the interval specified below to check for required local admin password changes. Note that the local admin password settings must be enabled independently of this setting</string>

      <string id="TS_SUPPORTED_OS">At least Microsoft Windows 8.1 or Windows Server 2012</string>


      <string id="pol_enableAgent_advanced">Enable advanced agent</string>
      <string id="pol_enableAgent_advanced_help">When this policy is enabled, the Access Manager Agent will be able to communicate directly with the Access Manager server, which enables advanced functionality, such as password storage in the Access Manager server, rather than AD.

If this policy is disabled or not configured, the agent will not be able to communicate with the Access Manager server for advanced functionality.
      </string>

      <string id="enum_authmode_aad">Azure Active Directory</string>
      <string id="enum_authmode_ams">Access Manager</string>


    </stringTable>

    <presentationTable>

      <presentation id="pol_enableAgent">
        <decimalTextBox refId="dtxt_interval" defaultValue="60">Agent check interval (minutes)</decimalTextBox>
      </presentation>

      <presentation id="pol_enableAgent_advanced">
        <textBox refId="txt_serverName" >
          <label>Fully-qualified server DNS name</label>
        </textBox>
        <text></text>
        <dropdownList refId="enum_authmode" defaultItem="0" noSort="true">Device authentication provider</dropdownList>
        <text></text>
        <text>If you are using Azure AD authentication, provide the Azure AD tenant ID where these devices are registered</text>
        <textBox refId="txt_tenantId" >
          <label>Azure AD tenant ID</label>
        </textBox>
      </presentation>

    </presentationTable>
  </resources>
</policyDefinitionResources>