<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0">
  <policyNamespaces>
    <target prefix="agentPassword" namespace="Lithnet.AccessManager.Password.Agent"/>
    <using prefix="agent" namespace="Lithnet.AccessManager.Agent" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
    <using prefix="lithnet" namespace="Lithnet" />
  </policyNamespaces>
  <supersededAdm fileName="" />
  <resources minRequiredRevision="1.0" />
  <supportedOn>
    <definitions>
      <definition name="TS_SUPPORTED_OS" displayName="$(string.TS_SUPPORTED_OS)" />
    </definitions>
  </supportedOn>
  <categories>
    <category name="cat_lithnet_accessManagerAgent_password" displayName="$(string.cat_lithnet_accessManagerAgent_password)">
      <parentCategory ref="agent:cat_lithnet_accessManagerAgent" />
    </category>
  </categories>
  <policies>
    <policy name="pol_password_generation"
            class="Machine"
            displayName="$(string.pol_password_generation)"
            explainText="$(string.pol_password_generation_help)"
            key="Software\Policies\Lithnet\AccessManager\Agent\Password"
            valueName="Enabled"
           presentation="$(presentation.pol_password_generation)">
      <parentCategory ref="cat_lithnet_accessManagerAgent_password" />
      <supportedOn ref="TS_SUPPORTED_OS" />
      <elements>
        <enum id="enum_storageMode" required="true" valueName="StorageMode">
          <item displayName="$(string.enum_appdata)">
            <value>
              <decimal value="1"/>
            </value>
          </item>
          <item displayName="$(string.enum_laps)">
            <value>
              <decimal value="2"/>
            </value>
          </item>
          <item displayName="$(string.enum_appdata_laps)">
            <value>
              <decimal value="3"/>
            </value>
          </item>
        </enum>
        <decimal id="dtxt_passwordLength" key="Software\Policies\Lithnet\AccessManager\Agent\Password" valueName="PasswordLength" required="true" minValue="6" maxValue="255"/>
        <decimal id="dtxt_passwordAge" valueName="MaximumPasswordAge" required="true" minValue="1" maxValue="99999"/>
        <boolean id="ck_useUpper" valueName="UseUpper">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="ck_useLower" valueName="UseLower">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="ck_useSymbol" valueName="UseSymbol">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="ck_useNumeric" valueName="UseNumeric">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
      </elements>
    </policy>

    <policy name="pol_history"
           class="Machine"
           displayName="$(string.pol_history)"
           explainText="$(string.pol_history_help)"
           key="Software\Policies\Lithnet\AccessManager\Agent\Password"
           valueName="EnablePasswordHistory"
           presentation="$(presentation.pol_history)">
      <parentCategory ref="cat_lithnet_accessManagerAgent_password" />
      <supportedOn ref="TS_SUPPORTED_OS" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
      <elements>
        <decimal id="dtxt_passwordHistoryDaysToKeep" key="Software\Policies\Lithnet\AccessManager\Agent\Password" valueName="PasswordHistoryDaysToKeep" required="false" minValue="0" maxValue="365"/>
      </elements>
    </policy>

  </policies>
</policyDefinitions>